Revit 2027 API
ParameterTypeId.RbsEnergyAnalysisIncludeThermalProperties Property
 "Detailed Elements"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsEnergyAnalysisIncludeThermalProperties { get; }
Public Shared ReadOnly Property RbsEnergyAnalysisIncludeThermalProperties As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsEnergyAnalysisIncludeThermalProperties {
	ForgeTypeId^ get ();
}
static member RbsEnergyAnalysisIncludeThermalProperties : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace